# SpotElevTickMarkPen Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevTickMarkPen Property
ParameterTypeId Class See Also
---
"Leader Arrowhead Line Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevTickMarkPen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevTickMarkPen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevTickMarkPen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace